# quiz_data.py
quiz_data = [
    {
        "id": 1,
        "type": "text",
        "image": "1.복지관.png",
        "question": "이 건물의 이름은??",
        "hint": "총학생회실과 동아리방이 위치하여 있습니다.",
        "answers": ["복지관"],
        "description": "총학생회실과 동아리방, 함지마루등 다양한 학교복지시설이 있는 건물"
    },
    {
        "id": 2,
        "type": "text",
        "image": "2.한울관.png",
        "question": "이 건물의 이름은?",
        "hint": "주로 문과학생들이 쓰는 건물입니다.",
        "answers": ["한울관"],
        "description": "인문사회과학대학과 정책법학대학 그리고 국제통상학부 학생들이 사용하는 건물"
    },
        {
        "id": 3,
        "type": "text",
        "image": "3.화도관.png",
        "question": "이 건물의 이름은?",
        "hint": "대학본부 및 총장실이 위치해 있습니다.",
        "answers": ["화도관"],
        "description": "대학본부 그리고 건축학과와 건축공학과 학생들이 쓰는 건물"
    },
    {
        "id": 4,
        "type": "text",
        "image": "4.누리관.png",
        "question": "이 건물의 이름은?",
        "hint": "학교에서 제일 멀리 떨어져 있는 건물입니다.",
        "answers": ["누리관"],
        "description": "로봇학부 및 경영학부 학생들이 쓰는 건물"
    },
    {
        "id": 5,
        "type": "text",
        "image": "5.광운스퀘어.png",
        "question": "이 장소의 이름은 무엇일까요?",
        "hint": "학생들이 자주 모이고 행사도 열리는 야외 공간입니다.",
        "answers": ["광운스퀘어", "스퀘어"],
        "description": "학교 중앙에 위치한 광장으로 다양한 행사와 모임이 이루어지는 장소"
    },
    {
        "id": 6,
        "type": "text",
        "image": "6.시계탑.png",
        "question": "이 구조물의 이름은 무엇일까요?",
        "hint": "학교의 상징적인 구조물로 시간을 알려주는 역할을 합니다.",
        "answers": ["시계탑"],
        "description": "학교의 대표 랜드마크 중 하나인 시계탑"
    },
    {
        "id": 7,
        "type": "text",
        "image": "7.동해문화예술관_소극장.png",
        "question": "이 장소의 이름이 무엇일까요?",
        "hint": "학교의 공연과 행사가 열리는 장소입니다.",
        "answers": ["동해문화예술관", "소극장", "동해문화예술관 소극장"],
        "description": "다양한 공연과 새내기 배움터 등 행사가 열리는 문화 공간"
    },
    {
        "id": 8,
        "type": "text",
        "image": "8.빛솔재.png",
        "question": "이 건물의 이름은 무엇일까요?",
        "hint": "학생들이 생활하는 기숙사 건물입니다.",
        "answers": ["빛솔재", "기숙사"],
        "description": "학생들이 거주하는 기숙사 건물"
    },
    {
        "id": 9,
        "type": "text",
        "image": "9.새빛관.png",
        "question": "이 건물의 이름은 무엇일까요?",
        "hint": "인공지능융합대학 학생들이 이용하는 건물입니다.",
        "answers": ["새빛관"],
        "description": "인공지능융합대학 학생들이 쓰는 건물"
    },
    {
        "id": 10,
        "type": "text",
        "image": "10.정보융합학부_과방.png",
        "question": "이 장소의 이름은 무엇일까요??",
        "hint": "정보융합학부 학생들이 모여 활동하는 공간입니다.",
        "answers": ["과방", "정보융합학부 과방"],
        "description": "정보융합학부 학생들의 휴식 및 활동 공간"
    },
    {
        "id": 11,
        "type": "text",
        "image": "11.기념관(뒷편).png",
        "question": "이 건물의 이름은 무엇일까요?",
        "hint": "도서관이 위치한 건물입니다",
        "answers": ["기념관", "80주년기념관"],
        "description": "학교의 역사와 전통을 기념하는 건물, 중앙도서관등이 위치하여 학교의 대표건물"
    },
    {
        "id": 12,
        "type": "text",
        "image": "12.오픈열람실.png",
        "question": "이 장소의 이름은?",
        "hint": "도서관 건물에 위치한 자유롭게 공부할 수 있는 개방형 학습 공간입니다.",
        "answers": ["오픈열람실", "열람실", "도서관"],
        "description": "도서관 내에 위치하고 있으며, 학생들이 자유롭게 이용할 수 있는 학습 공간"
    }
]
    
    